src/cf/Documents/bon_МакетинговыеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_МакетинговыеАкции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_ВыдаваемыеЦенности</xr:Item>
				<xr:Item>InformationRegister.bon_УсловиеСчетчикаКратности</xr:Item>
				<xr:Item>InformationRegister.bon_КаскадныеСкидки</xr:Item>
				<xr:Item>InformationRegister.bon_СкидкиНаТовар</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИскомСчетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКратности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКратности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеСуммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_УсловиеМаркентиговойАктивности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_ТипЦенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонусыФикс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаБонусов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидкиНаценкиТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_ВидСкидкиНаценкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьОтборПоТовару</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействующиеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредоставляемаяЦенностьПодарок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подарок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаТовар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компенсация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогЦенаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КаскадныеСкидкиТаб</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПозицияВЗаказе</Name>
							<Type>
								<v8:Type>cfg:EnumRef.bon_ПозицииДляКаскада</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыДляОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/bon_УсловиеСчетчикаКратности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_УсловиеСчетчикаКратности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеИскомСчетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолКратности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентВоз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УсловиеСуммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКратности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУсловиюВоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаркетинговаяАкция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.bon_МакетинговыеАкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/bon_УсловиеМаркентиговойАктивности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_УсловиеМаркентиговойАктивности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСчетчикуИКрастности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкидкаНаТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаскадныеСкидки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/bon_ВидСкидкиНаценкиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_ВидСкидкиНаценкиТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/bon_МакетинговыеАкции/Ext/ObjectModule.bsl
&НаСервере
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВидДокумента = Перечисления.bon_УсловиеМаркентиговойАктивности.ПоСчетчикуИКрастности Тогда
		ПоСчетчикуИКрастностиОперация();		
	ИначеЕсли ВидДокумента = Перечисления.bon_УсловиеМаркентиговойАктивности.СкидкаНаТовар Тогда
		СкидкаНаТоварОперация();
	ИначеЕсли ВидДокумента = Перечисления.bon_УсловиеМаркентиговойАктивности.КаскадныеСкидки Тогда 
		КаскадныеСкидкиОперация();	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПоСчетчикуИКрастностиОперация()
	
	///Запись зданных в регистр для счетчика и кратности
	Если ПоКратности = Истина или ПоСчетчику = Истина или ПоСумме = Истина Тогда 
		Движения.bon_УсловиеСчетчикаКратности.Записывать = Истина;
		Движения.bon_УсловиеСчетчикаКратности.Очистить();
		Для Каждого стрТЧ Из ДействующиеСтруктурныеЕдиницы Цикл
			Движение = Движения.bon_УсловиеСчетчикаКратности.Добавить();
			Движение.Организация 				= стрТЧ.Организация;
			Движение.ПодразделениеОрганизации 	= стрТЧ.ПодразделениеОрганизации;
			Движение.МаркетинговаяАкция 		= Ссылка;	
			Движение.ПериодДействияНачало 		= ПериодДействияНачало;
			Движение.ПериодДействияКонец 		= ПериодДействияКонец;	
			Если ПоСчетчику = Истина Тогда
				Движение.ПоСчетчику 			= ПоСчетчику;
				Движение.ЗначениеИскомСчетчик 	= ЗначениеИскомСчетчик;
				Движение.УсловиеСчетчика 		= УсловиеСчетчика;
			Иначе 
				Движение.ПоСчетчику 			= ПоСчетчику;
			КонецЕсли;
			Если ПоКратности = Истина Тогда 
				Движение.ПоКратности 			= ПоКратности;
				Движение.Кратность 				= Кратность;
				Движение.КолКратности 			= КолКратности;
			Иначе 
				Движение.ПоКратности 			= ПоКратности;
			КонецЕсли;
			Если ПоСумме = Истина Тогда 
				Движение.ПоСумме 				= ПоСумме;
				Движение.Сумма 					= Сумма;
				Движение.УсловиеСуммы 			= УсловиеСуммы;
			Иначе 
				Движение.ПоСумме 				= ПоСумме;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Движения.bon_УсловиеСчетчикаКратности.Записать();
	
	
	// Движения по bon_ВыдаваемыеЦенности
	Движения.bon_ВыдаваемыеЦенности.Записывать = Истина;
	Движения.bon_ВыдаваемыеЦенности.Очистить();
	
	Если ТипЦенности = Перечисления.bon_ТипЦенности.ПроцентБонусов Тогда
		Движение = Движения.bon_ВыдаваемыеЦенности.Добавить();
		Движение.Период				= Дата;
		Движение.МаркетинговойАкции = Ссылка;
		Движение.ТипЦенности 		= ТипЦенности;
		Движение.Приоритет 			= Приоритет;	
		Движение.НомерВарианта 		= Число(1);
		Движение.Значение 			= ПроцентБонусов;	
	ИначеЕсли ТипЦенности = Перечисления.bon_ТипЦенности.ФиксированныеБонусы Тогда
		Движение = Движения.bon_ВыдаваемыеЦенности.Добавить();
		Движение.Период				= Дата;
		Движение.МаркетинговойАкции = Ссылка;
		Движение.ТипЦенности 		= ТипЦенности;
		Движение.Приоритет 			= Приоритет;	
		Движение.НомерВарианта 		= Число(1);
		Движение.Значение 			= БонусыФикс;		
	ИначеЕсли ТипЦенности = Перечисления.bon_ТипЦенности.Подарок Тогда	
		Для каждого Значение Из ПредоставляемаяЦенностьПодарок Цикл	
			Движение = Движения.bon_ВыдаваемыеЦенности.Добавить();
			Движение.Период				= Дата;
			Движение.МаркетинговойАкции = Ссылка;
			Движение.ТипЦенности 		= ТипЦенности;
			Движение.Приоритет 			= Приоритет;	
			Движение.НомерВарианта 		= Значение.НомерСтроки;
			Движение.Значение 			= Значение.Подарок;			
		КонецЦикла; 
	КонецЕсли;
	Движения.bon_ВыдаваемыеЦенности.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СкидкаНаТоварОперация()
	
	Движения.bon_СкидкиНаТовар.Записывать = Истина;
	Движения.bon_СкидкиНаТовар.Очистить();

	Для Каждого стрТЧ Из ДействующиеСтруктурныеЕдиницы Цикл
		Для Каждого ТекСтрокаСкидкиНаТовар Из СкидкиНаТовар Цикл
			Движение = Движения.bon_СкидкиНаТовар.Добавить();
			Движение.Приоритет				= Приоритет;
			Движение.Подразделение 			= стрТЧ.ПодразделениеОрганизации;
			Движение.ДатаНач 				= ПериодДействияНачало;
			Движение.ДатаКон 				= ПериодДействияКонец;
			Движение.Номенклотура 			= ТекСтрокаСкидкиНаТовар.Номенклатура;
			
			Если ТекСтрокаСкидкиНаТовар.НомГруппа = Истина Тогда
				Движение.НомГруппа 				= Строка(ТекСтрокаСкидкиНаТовар.Номенклатура);
				Движение.ЭтоНомГруппа			= Истина;
			КонецЕсли;
			
			Движение.ВидЦены 				= ВидЦены;
			Движение.ВидСкидкиНаценкиТовара = ВидСкидкиНаценкиТовара;
			Если ВидСкидкиНаценкиТовара = Перечисления.bon_ВидСкидкиНаценкиТовара.Процент Тогда
				Движение.Процент 				= ПроцентСкидкиНаценки;
				Движение.СпецЦена 				= Число(0);
			ИначеЕсли ВидСкидкиНаценкиТовара = Перечисления.bon_ВидСкидкиНаценкиТовара.Сумма Тогда
				Движение.Процент 				= Число(0);
				Движение.СпецЦена 				= ТекСтрокаСкидкиНаТовар.ИтогЦена;				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Движения.bon_СкидкиНаТовар.Записать();
	
КонецПроцедуры

&НаСервере
Процедура КаскадныеСкидкиОперация()
	
	Движения.bon_КаскадныеСкидки.Записывать = Истина;
	Движения.bon_КаскадныеСкидки.Очистить();
	
	Для Каждого стрТЧ Из ДействующиеСтруктурныеЕдиницы Цикл
		Для Каждого ТекСтрокаСкидкиНаТовар Из КаскадныеСкидкиТаб Цикл
			Движение = Движения.bon_КаскадныеСкидки.Добавить();
			Движение.Приоритет				= Приоритет;
			Движение.Подразделение 			= стрТЧ.ПодразделениеОрганизации;
			Движение.ДатаНач 				= ПериодДействияНачало;
			Движение.ДатаКон 				= ПериодДействияКонец;
			
			Движение.ПозицияВЗаказе			= ТекСтрокаСкидкиНаТовар.ПозицияВЗаказе;
			Движение.Процент 				= ТекСтрокаСкидкиНаТовар.ПроцентСкидки;
			Движение.НомПоз 				= ТекСтрокаСкидкиНаТовар.НомерСтроки;
		КонецЦикла;
	КонецЦикла;
	
	Движения.bon_КаскадныеСкидки.Записать();
	
КонецПроцедуры
